quecocinamoshoy-api/app/controllers/categories_controller.rb

	def index
		categorias = Category.all.select(:id, :name)
		render json: {data: categorias, count: categorias.length}, status: :ok
---
SELECT "categories"."id", "categories"."name" FROM "categories"
SELECT "categories".* FROM "categories"
SELECT COUNT(id, name) FROM "categories"

	def recipes
		recetas = Recipe.where(["category_id = ?", params[:id]]).select(:id, :name)
		render json: {data: recetas, count: recetas.length}, status: :ok
---
SELECT "recipes"."id", "recipes"."name" FROM "recipes" WHERE (category_id = '1')
SELECT "recipes".* FROM "recipes" WHERE (category_id = '1')