quecocinamoshoy-api/app/controllers/recipes_controller.rb

SELECT  "recipes"."name", "recipes"."user_id", "recipes"."ingredients", "recipes"."procedure" FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users"."name" FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		receta = Recipe.select(:name, :user_id, :ingredients, :procedure).find(params[:id])
		usuario = User.select(:name).find(receta.user_id)